 
console.log('Выполнено всё из секции Требования к репозиторию и как сабмитить задание +30');
console.log('Слайдер позиционируется с равными отступами слева и справа +10');
console.log('Соблюдено расположение картинок, подписей к ним и контролов +10');
console.log('Имеется анимация для смены картинок +20');
console.log('Имеется анимация для смены подписей к картинкам +10');
console.log('Подписи к картинкам должны быть строковыми значениями (текстом), т.е. текст не должен быть частью картинки +15');
console.log('Каждый контрол имеет большую область нажатия, чем размер самого контрола +5');
console.log('Контролы имеют интерактивность (момент наведения, момент нажатия, активный контрол, изменение курсора) +10');
console.log('Имеется мобилная версия слайдера и соблюдено расположение картинок, подписей к ним и контролов +20');
console.log('Используются относительные едициы измерения для основных блоков (rem, em, %, vh, vw, fr and etc... ) +10');
console.log('Все блоки/составные части слайдера (контролы, картинки, подписи к слайдеру) спозиционированы без использования position: absolute +10');

console.log("Итоговая оценка: 150");